{"posts":[{"title":"Beginning","text":"博主大三上结束，时间充裕起来了，准备在寒假完成接下来的三篇论文就开始写点博客玩玩。 本博客会分享技术和生活方面的文章。由于我研究方向是密码学，并且目前国内密码学优质的文章确实太少，目前准备主要更新密码学相关的文章，希望能帮助到想要入门的大伙（光是入门就太难辣）。之后随着研究领域扩宽会加一些其他研究方向的分享。生活方面会有一些其他杂七杂八的内容，包括但不限于对去去过的饭店、酒吧、动漫的评价。","link":"/2022/12/14/Beginning/"},{"title":"Web3 DID","text":"最近在看Web3.0的DID（去中心化身份），在这里写一篇笔记。说实话，这个领域目前还处于摸索阶段，真正落地的项目不多，刚接触的人对Web3.0的描述只能停留于加密货币、区块链、去中心化、数据所有权、反垄断等花里胡哨的关键词。Web3.0真正该怎么做，其实没有人能说清楚。虽然它的功能很吸引人，但是依然有很多gap需要跨过，比如密钥管理，隐私保护，改变用户习惯。其究竟能不能火起来也是个未知数（毕竟即使是以太坊月活才一千万，在网络中这个体量还是比较小），但是我认为研究Web3.0包括DID在内的基础设施和协议建设是很有价值的，毕竟学术就是发现的过程，自己的发现能用起来那肯定是最好的，即使自己的发现没有作用也可以很好的给后人避坑。 从登录来引入DIDWeb1主要使用用户名+密码来登录，Web2可以使用谷歌腾讯等各个大平台的账号登录其他平台。上述两个版本有一个显著问题，用户的账号密码以及其他数据都是存储在中心化的平台中，他自身没有对数据的主权，用户需要冒着自己数据资产被中心化实体控制的风险来使用实体的服务。这会造成不可信中心化实体窃取数据、中心化实体被攻击造成数据泄露等一系列风险。而Web3就是想解决这个问题，用户的数据由用户自己持有并整理到数字钱包中，用户想要使用一个平台的服务时只需要选择性地将钱包的一些数据发送给平台进行验证，验证通过就能使用平台的服务。用钱包登录就是DID的一种功能或者说是应用方向，但是需要注意钱包和DID并不能等同看待，一个身份可以具有多个钱包。DID利用区块链去中心化不需许可的抗审查的分布式数据库，保证数据完整性审查的身份认证的密码技术，给互联网的应用层之下再添加一个身份层。 DID可以是用户的一个智能合约，其他智能合约可以与用户的智能合约交互，获取信息和资产的反馈，这个智能合约就是用户在数字世界的代言，是数字世界的ID。它也可以是帮助管理个人数据存储个人数据的应用，用户可以用这个应用登录别的应用，或者利用该应用把数据传输给dAPP，在存储和传输过程中，数据的控制权完全被用户控制。当然DID也可以是其他形式。 DID中，用户可以自主生成不同场景、服务使用的不同身份，每个身份指选择性披露部分身份信息，自己负责身份隔离。比如购买东西时，卖方只能短时间读取买方部分信用卡信息，DID是通过给予用户数据主权来帮助加强用户数据隐私保护的基础设施。 DID的隐私问题隐私是Web3去中心化和数据主权之后的第三大目标，现有DID具有但不限于如下隐私问题： 较多用户有分享的习惯，他们会向外公开一部分DID中包含的甚至是自己真实身份信息，造成隐私泄露。 DID被攻击者窃取造成用户数据全部泄露。 密码学天生就是为了隐私保护而生的，目前利用密码学技术来解决DID的隐私问题具有很大的研究空间。比如 门限加密，身份基加密，属性基加密：这三种密码技术可以为用户自助披露DID中的而信息提供细粒度的访问控制。 各种通用的隐私计算技术：当用户进行登录认证、在不想泄露隐私同时分享信息，就可以用到零知识证明等隐私计算技术。 群签名、环签名、盲签名：虽然在区块链中还是环签名用的最多，但是Web3.0的DID隐私可能会为群签名和盲签名注入新的活力。 总结这篇写的比较屎，等元旦节自己好好完善这篇文章的逻辑，丰富内容","link":"/2022/12/28/Web3%20DID/"}],"tags":[{"name":"闲谈","slug":"闲谈","link":"/tags/%E9%97%B2%E8%B0%88/"},{"name":"WEB3","slug":"WEB3","link":"/tags/WEB3/"},{"name":"密码学","slug":"密码学","link":"/tags/%E5%AF%86%E7%A0%81%E5%AD%A6/"},{"name":"区块链","slug":"区块链","link":"/tags/%E5%8C%BA%E5%9D%97%E9%93%BE/"}],"categories":[{"name":"生活","slug":"生活","link":"/categories/%E7%94%9F%E6%B4%BB/"},{"name":"技术","slug":"技术","link":"/categories/%E6%8A%80%E6%9C%AF/"}],"pages":[{"title":"tags","text":"","link":"/tags/index.html"},{"title":"categories","text":"","link":"/categories/index.html"},{"title":"About","text":"MEGUMI 出自番剧《路人女主的养成方法》中女主角加藤惠（Katou Megumi）的名。 21岁事学生（写的时候是2022年）。爱好：番剧，冲浪，喝酒，游戏，旅游。看番比较喜欢轻百、校园以及比较甜（不是指工业糖精）的番，如果是很精彩的打斗番也喜欢看。由于冲浪强度较高，可能平时也比较喜欢搞抽象（。喝酒比较喜欢干喝威士忌和以金酒为基酒的鸡尾酒。平时压力大或者闲下来会打打极地大乱斗和mc。喜欢以露营的方式旅游（因《摇曳露营》入的坑，现在还是露营方面的萌新）。 目前在从事密码学应用和交叉领域的研究，主要研究方向有可证明安全，属性基加密，零知识证明，安全多方计算。 博客主要用于分享技术、生活以及一些感想。技术方面主要分享密码相关的技术，希望能帮到想要了解或者入门密码学的人，可能分享的方向会随着研究领域的拓宽而增加。 本人目前写作的逻辑能力有待加强😭，希望能借助博客提升我的写作能力。","link":"/about/index.html"}]}